function process(str){
    return `常住人口(万人),${str.match(/(?<=常住人口[^，。；\n]*?)[0-9.\s]+(?=万人)/)?.join() || "Not found"}
常住人口增加(万人),${str.match(/(?<=常住人口[^，。；\n]*?[0-9.\s]+万人[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || "Not found"}
城镇常住人口(万人),${str.match(/(?<=城镇常住人口[^，。；\n]*?)[0-9.\s]+(?=万人)/)?.join() || "Not found"}
城镇常住人口占比(%),${str.match(/(?<=城镇常住人口[^，。；\n]*?[0-9.\s]+万人[^；。\n]*?)[0-9.\s]+(?=%)/)?.join() || "Not found"}
户籍人口(万人),${str.match(/(?<=户籍[^，。；\n]*?人口[^，。；\n]*?)[0-9.\s]+(?=万人)/)?.join() || "Not found"}
户籍人口增加(万人),${str.match(/(?<=户籍[^，。；\n]*?人口[^，。；\n]*?[0-9.\s]+万人[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=户籍[^，。；\n]*?人口[^，。；\n]*?[0-9.\s]+万人[^；。\n]*?[下减少][^；。\n]*?)[0-9.\s]+/)?.join() || "Not found"}
人口出生率(‰),${str.match(/(?<=出生率[^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
人口死亡率(‰),${str.match(/(?<=死亡率[^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
自然增长率(‰),${str.match(/(?<=自然增长率[^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
城镇新增就业(万人),${str.match(/(?<=城镇新增就业[^，。；\n]*?)[0-9.\s]+(?=万人)/)?.join() || "Not found"}
就业困难人员实现再就业(人),${str.match(/(?<=就业困难[^，。；\n]*?再就业[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
失业人员再就业(人),${str.match(/(?<=失业[^，。；\n]*?再就业[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
地区生产总值(亿元),${str.match(/(?<=地区生产总值[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
地区生产总值增长率,${str.match(/(?<=地区生产总值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=地区生产总值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
第一产业增加值(亿元),${str.match(/(?<=第一产业增加值[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
第一产业增长率(%),${str.match(/(?<=第一产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=第一产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
第二产业增加值(亿元),${str.match(/(?<=第二产业增加值[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
第二产业增长率(%),${str.match(/(?<=第二产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=第二产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
第三产业增加值(亿元),${str.match(/(?<=第三产业增加值[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
第三产业增长率(%),${str.match(/(?<=第三产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=第三产业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
居民人均可支配收入(元),${str.match(/(?<=可支配收入[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
居民人均可支配收入增长率(%),${str.match(/(?<=可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
农村居民人均可支配收入(元),${str.match(/(?<=农村[^，。；\n]*?可支配收入[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
农村居民人均可支配收入增长率(%),${str.match(/(?<=农村[^，。；\n]*?可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=农村[^，。；\n]*?可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
城镇居民人均可支配收入(元),${str.match(/(?<=城镇[^，。；\n]*?可支配收入[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
城镇居民人均可支配收入增长率(%),${str.match(/(?<=城镇[^，。；\n]*?可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=城镇[^，。；\n]*?可支配收入[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
一般公共预算总收入(亿元),${str.match(/(?<=一般公共预算总收入[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
一般公共预算总收入增长率(%),${str.match(/(?<=一般公共预算总收入[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=一般公共预算总收入[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
地方一般公共预算收入(亿元),${str.match(/(?<=一般公共预算收入[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
地方一般公共预算收入增长率(%),${str.match(/(?<=一般公共预算收入[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=地方一般公共预算收入[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
税收收入(亿元),${str.match(/(?<=税收[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
税收收入增长率(%),${str.match(/(?<=税收[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=税收[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
地方一般公共预算支出(亿元),${str.match(/(?<=一般公共预算支出[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
地方一般公共预算支出增长率(%),${str.match(/(?<=一般公共预算支出[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=一般公共预算支出[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
农林牧渔业总产值(亿元),${str.match(/(?<=农林牧渔业[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
农林牧渔业总产值增长率(%),${str.match(/(?<=农林牧渔业[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=农林牧渔业[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
全部工业增加值(亿元),${str.match(/(?<=工业增加值[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
全部工业增加值增长率(%),${str.match(/(?<=工业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=工业增加值[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
建筑业增加值(亿元),${str.match(/(?<=建筑业[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
建筑业增加值增长率(%),${str.match(/(?<=建筑业[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=建筑业[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
居民人均生活消费支出(元),${str.match(/(?<=生活消费支出[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
居民人均生活消费支出增长率(%),${str.match(/(?<=生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
农村居民人均生活消费支出(元),${str.match(/(?<=农村[^，。；\n]*?生活消费支出[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
农村居民人均生活消费支出增长率(%),${str.match(/(?<=农村[^，。；\n]*?生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=农村[^，。；\n]*?生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
城镇居民人均生活消费支出(元),${str.match(/(?<=城镇[^，。；\n]*?生活消费支出[^，。；\n]*?)[0-9.\s]+(?=元)/)?.join() || "Not found"}
城镇居民人均生活消费支出增长率(%),${str.match(/(?<=城镇[^，。；\n]*?生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=城镇[^，。；\n]*?生活消费支出[^，。；\n]*?[0-9.\s]+元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
社会消费品零售总额(亿元),${str.match(/(?<=社会消费品零售总额[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
社会消费品零售总额增长率(%),${str.match(/(?<=社会消费品零售总额[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=生活消费支出[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
乡村消费品零售额(亿元),${str.match(/(?<=村[^，。；\n]*?消费品零售额[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
乡村消费品零售额增长率(%),${str.match(/(?<=村[^，。；\n]*?消费品零售额[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=村[^，。；\n]*?消费品零售额[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
城镇消费品零售额(亿元),${str.match(/(?<=城[^，。；\n]*?消费品零售额[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
城镇消费品零售额增长率(%),${str.match(/(?<=城[^，。；\n]*?消费品零售额[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=城[^，。；\n]*?生活消费支出[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
进出口总额(亿元),${str.match(/(?<=进出口[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
进出口总额增长率(%),${str.match(/(?<=进出口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=进出口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
出口额(亿元),${str.match(/(?<=[^进]出口[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
出口额增长率(%),${str.match(/(?<=[^进]出口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=[^进]出口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
进口额(亿元),${str.match(/(?<=进口[^，。；\n]*?)[0-9.\s]+(?=亿元)/)?.join() || "Not found"}
进口额增长率(%),${str.match(/(?<=进口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9.\s]+/)?.join() || -str.match(/(?<=进口[^，。；\n]*?[0-9.\s]+亿元[^；。\n]*?[下减少][^，。；\n]*?)[0-9.\s]+/)?.join() || "Not found"}
领取失业保险金人数(人),${str.match(/(?<=领取失业保险[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
领取失业保险金人数增长(人),${str.match(/(?<=领取失业保险[^，。；\n]*?[0-9\s]+人[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9\s]+/)?.join() || -str.match(/(?<=领取失业保险[^，。；\n]*?[0-9\s]+人[^；。\n]*?[下减少][^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
城市最低生活保障人数(人),${str.match(/(?<=城[^，。；\n]*?最低生活保障[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
城市最低生活保障人数增长(人),${str.match(/(?<=城[^，。；\n]*?最低生活保障[^，。；\n]*?[0-9\s]+人[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9\s]+/)?.join() || -str.match(/(?<=城[^，。；\n]*?最低生活保障[^，。；\n]*?[0-9\s]+人[^；。\n]*?[下减少][^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
农村最低生活保障人数(人),${str.match(/(?<=村[^，。；\n]*?最低生活保障[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
农村最低生活保障人数增长(人),${str.match(/(?<=村[^，。；\n]*?最低生活保障[^，。；\n]*?[0-9\s]+人[^；。\n]*?[增长涨\s][^；。\n]*?)[0-9\s]+/)?.join() || -str.match(/(?<=村[^，。；\n]*?最低生活保障[^，。；\n]*?[0-9\s]+人[^；。\n]*?[下减少][^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
保障特困人员供养对象(人),${str.match(/(?<=特困[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
研究生教育招生(人),${str.match(/(?<=研究生教育招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
在校研究生(人),${str.match(/(?<=研究生教育招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
普通高等教育招生(人),${str.match(/(?<=普通高等教育招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
普通高等教育在校生(人),${str.match(/(?<=普通高等教育招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
中等职业教育招生(人),${str.match(/(?<=中等职业教育招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
中等职业教育在校生(人),${str.match(/(?<=中等职业教育招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
普通高中招生(人),${str.match(/(?<=普通高中招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
普通高中在校生(人),${str.match(/(?<=普通高中招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
初中招生(人),${str.match(/(?<=初中招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
初中在校生(人),${str.match(/(?<=初中招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
普通小学招生(人),${str.match(/(?<=普通小学招生[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
普通小学在校生(人),${str.match(/(?<=普通小学招生[^，。；\n]*?[0-9\s]+人[^。；]*?在校[^，。；\n]*?)[0-9\s]+/)?.join() || "Not found"}
特殊教育在校生(人),${str.match(/(?<=特殊教育[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
学前教育在园幼儿(人),${str.match(/(?<=学前教育[^，。；\n]*?)[0-9\s]+(?=人)/)?.join() || "Not found"}
市级示范园(所),${str.match(/(?<=市级示范园[^，。；\n]*?)[0-9\s]+(?=所)/)?.join() || "Not found"}
省级达标中学(所),${str.match(/(?<=省级达标中学[^，。；\n]*?)[0-9\s]+(?=所)/)?.join() || "Not found"}
初中毕业升学率(%),${str.match(/(?<=初中毕业升学率[^，。；\n]*?)[0-9.\s]+(?=%)/)?.join() || "Not found"}`;
}
let downloadLink = document.createElement("a");
downloadLink.href = URL.createObjectURL(new Blob([new TextEncoder("GB2312").encode(process(document.body.innerText)).buffer],{type:"text/plain"}));
downloadLink.download = `${document.body.innerText.match(/20[0-9]{2}年.*?统计公报/).join()}.csv`;
downloadLink.click();